src/cf/Catalogs/QuestionnaireAnswersOptions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>QuestionnaireAnswersOptions</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.QuestionsForSurvey</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>OpenEndedQuestion</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddlOrderingAttribute</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/QuestionAnswerTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>QuestionAnswerTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>String</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Text</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Number</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Date</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Boolean</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InfobaseValue</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OneVariantOf</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MultipleOptionsFor</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/QuestionnaireAnswersOptions/Forms/ItemForm/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Region EventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("Owner")
		AND TypeOf(Parameters.Owner) = Type("ChartOfCharacteristicTypesRef.QuestionsForSurvey")
		AND NOT Parameters.Owner.IsEmpty() Then
			
			Object.Owner = Parameters.Owner;
		
	Else
		
		MessageText = NStr("ru = 'Данная форма предназначена для открытия только из формы элемента плана вида характеристик ""Вопросы для анкетирования""'; en = 'This form is opened from the form of the item of the chart of characteristic types ""Survey questions"".'; pl = 'This form is opened from the form of the item of the chart of characteristic types ""Survey questions"".';de = 'This form is opened from the form of the item of the chart of characteristic types ""Survey questions"".';ro = 'This form is opened from the form of the item of the chart of characteristic types ""Survey questions"".';tr = 'This form is opened from the form of the item of the chart of characteristic types ""Survey questions"".'; es_ES = 'This form is opened from the form of the item of the chart of characteristic types ""Survey questions"".'");
		Common.MessageToUser(MessageText);
		Cancel = True;
		Return;
		
	EndIf;
	
	If Parameters.Property("ReplyType") Then
		Items.OpenEndedQuestion.Visible = (Parameters.ReplyType = Enums.QuestionAnswerTypes.MultipleOptionsFor);
	Else
		Items.OpenEndedQuestion.Visible = (Object.Owner.ReplyType = Enums.QuestionAnswerTypes.MultipleOptionsFor);
	EndIf;
	
	If Parameters.Property("Description") Then
		Object.Description = Parameters.Description;
	EndIf;
	
EndProcedure

#EndRegion
